# PathReinforcementEmptySketch Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..PathReinforcementEmptySketch Property
BuiltInFailures..::..SketchFailures Class See Also
---
Sketch is empty. Can't create Path Reinforcement.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId PathReinforcementEmptySketch { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PathReinforcementEmptySketch As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ PathReinforcementEmptySketch {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace